###################################################################

# Created by write_sdc on Thu Dec 12 06:58:25 2019

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_operating_conditions ss0p95v125c -library saed32hvt_ss0p95v125c
set_wire_load_mode enclosed
set_max_fanout 0.82 [current_design]
set_max_area 0
set_wire_load_selection_group predcaps
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 2.7  -waveform {0 1.35}
set_input_delay -clock clk  1  [get_ports rst_n]
set_input_delay -clock clk  1  [get_ports enable]
set_input_delay -clock clk  1  [get_ports {input_data[7]}]
set_input_delay -clock clk  1  [get_ports {input_data[6]}]
set_input_delay -clock clk  1  [get_ports {input_data[5]}]
set_input_delay -clock clk  1  [get_ports {input_data[4]}]
set_input_delay -clock clk  1  [get_ports {input_data[3]}]
set_input_delay -clock clk  1  [get_ports {input_data[2]}]
set_input_delay -clock clk  1  [get_ports {input_data[1]}]
set_input_delay -clock clk  1  [get_ports {input_data[0]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[127]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[126]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[125]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[124]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[123]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[122]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[121]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[120]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[119]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[118]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[117]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[116]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[115]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[114]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[113]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[112]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[111]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[110]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[109]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[108]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[107]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[106]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[105]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[104]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[103]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[102]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[101]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[100]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[99]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[98]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[97]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[96]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[95]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[94]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[93]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[92]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[91]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[90]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[89]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[88]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[87]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[86]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[85]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[84]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[83]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[82]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[81]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[80]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[79]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[78]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[77]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[76]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[75]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[74]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[73]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[72]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[71]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[70]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[69]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[68]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[67]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[66]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[65]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[64]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[63]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[62]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[61]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[60]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[59]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[58]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[57]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[56]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[55]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[54]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[53]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[52]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[51]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[50]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[49]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[48]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[47]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[46]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[45]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[44]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[43]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[42]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[41]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[40]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[39]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[38]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[37]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[36]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[35]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[34]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[33]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[32]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[31]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[30]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[29]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[28]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[27]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[26]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[25]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[24]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[23]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[22]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[21]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[20]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[19]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[18]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[17]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[16]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[15]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[14]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[13]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[12]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[11]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[10]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[9]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[8]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[7]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[6]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[5]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[4]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[3]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[2]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[1]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a0[0]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[127]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[126]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[125]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[124]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[123]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[122]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[121]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[120]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[119]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[118]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[117]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[116]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[115]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[114]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[113]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[112]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[111]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[110]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[109]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[108]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[107]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[106]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[105]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[104]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[103]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[102]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[101]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[100]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[99]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[98]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[97]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[96]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[95]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[94]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[93]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[92]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[91]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[90]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[89]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[88]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[87]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[86]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[85]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[84]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[83]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[82]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[81]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[80]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[79]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[78]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[77]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[76]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[75]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[74]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[73]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[72]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[71]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[70]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[69]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[68]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[67]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[66]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[65]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[64]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[63]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[62]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[61]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[60]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[59]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[58]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[57]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[56]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[55]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[54]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[53]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[52]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[51]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[50]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[49]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[48]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[47]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[46]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[45]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[44]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[43]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[42]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[41]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[40]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[39]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[38]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[37]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[36]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[35]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[34]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[33]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[32]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[31]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[30]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[29]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[28]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[27]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[26]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[25]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[24]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[23]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[22]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[21]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[20]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[19]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[18]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[17]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[16]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[15]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[14]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[13]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[12]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[11]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[10]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[9]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[8]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[7]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[6]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[5]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[4]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[3]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[2]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[1]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a1[0]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[127]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[126]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[125]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[124]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[123]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[122]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[121]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[120]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[119]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[118]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[117]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[116]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[115]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[114]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[113]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[112]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[111]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[110]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[109]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[108]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[107]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[106]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[105]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[104]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[103]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[102]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[101]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[100]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[99]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[98]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[97]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[96]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[95]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[94]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[93]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[92]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[91]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[90]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[89]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[88]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[87]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[86]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[85]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[84]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[83]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[82]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[81]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[80]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[79]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[78]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[77]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[76]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[75]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[74]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[73]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[72]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[71]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[70]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[69]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[68]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[67]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[66]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[65]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[64]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[63]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[62]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[61]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[60]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[59]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[58]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[57]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[56]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[55]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[54]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[53]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[52]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[51]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[50]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[49]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[48]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[47]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[46]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[45]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[44]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[43]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[42]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[41]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[40]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[39]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[38]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[37]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[36]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[35]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[34]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[33]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[32]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[31]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[30]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[29]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[28]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[27]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[26]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[25]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[24]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[23]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[22]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[21]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[20]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[19]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[18]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[17]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[16]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[15]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[14]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[13]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[12]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[11]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[10]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[9]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[8]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[7]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[6]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[5]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[4]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[3]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[2]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[1]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a2[0]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[127]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[126]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[125]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[124]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[123]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[122]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[121]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[120]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[119]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[118]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[117]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[116]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[115]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[114]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[113]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[112]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[111]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[110]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[109]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[108]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[107]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[106]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[105]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[104]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[103]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[102]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[101]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[100]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[99]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[98]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[97]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[96]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[95]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[94]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[93]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[92]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[91]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[90]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[89]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[88]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[87]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[86]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[85]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[84]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[83]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[82]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[81]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[80]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[79]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[78]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[77]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[76]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[75]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[74]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[73]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[72]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[71]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[70]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[69]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[68]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[67]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[66]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[65]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[64]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[63]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[62]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[61]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[60]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[59]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[58]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[57]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[56]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[55]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[54]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[53]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[52]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[51]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[50]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[49]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[48]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[47]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[46]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[45]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[44]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[43]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[42]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[41]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[40]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[39]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[38]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[37]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[36]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[35]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[34]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[33]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[32]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[31]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[30]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[29]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[28]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[27]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[26]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[25]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[24]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[23]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[22]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[21]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[20]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[19]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[18]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[17]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[16]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[15]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[14]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[13]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[12]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[11]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[10]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[9]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[8]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[7]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[6]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[5]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[4]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[3]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[2]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[1]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_a3[0]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[127]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[126]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[125]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[124]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[123]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[122]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[121]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[120]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[119]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[118]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[117]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[116]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[115]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[114]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[113]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[112]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[111]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[110]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[109]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[108]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[107]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[106]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[105]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[104]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[103]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[102]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[101]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[100]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[99]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[98]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[97]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[96]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[95]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[94]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[93]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[92]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[91]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[90]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[89]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[88]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[87]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[86]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[85]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[84]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[83]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[82]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[81]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[80]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[79]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[78]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[77]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[76]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[75]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[74]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[73]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[72]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[71]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[70]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[69]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[68]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[67]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[66]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[65]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[64]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[63]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[62]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[61]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[60]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[59]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[58]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[57]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[56]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[55]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[54]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[53]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[52]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[51]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[50]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[49]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[48]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[47]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[46]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[45]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[44]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[43]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[42]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[41]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[40]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[39]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[38]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[37]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[36]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[35]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[34]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[33]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[32]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[31]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[30]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[29]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[28]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[27]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[26]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[25]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[24]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[23]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[22]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[21]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[20]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[19]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[18]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[17]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[16]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[15]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[14]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[13]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[12]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[11]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[10]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[9]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[8]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[7]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[6]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[5]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[4]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[3]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[2]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[1]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b0[0]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[127]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[126]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[125]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[124]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[123]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[122]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[121]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[120]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[119]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[118]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[117]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[116]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[115]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[114]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[113]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[112]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[111]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[110]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[109]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[108]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[107]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[106]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[105]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[104]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[103]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[102]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[101]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[100]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[99]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[98]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[97]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[96]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[95]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[94]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[93]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[92]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[91]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[90]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[89]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[88]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[87]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[86]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[85]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[84]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[83]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[82]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[81]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[80]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[79]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[78]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[77]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[76]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[75]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[74]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[73]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[72]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[71]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[70]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[69]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[68]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[67]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[66]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[65]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[64]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[63]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[62]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[61]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[60]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[59]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[58]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[57]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[56]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[55]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[54]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[53]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[52]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[51]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[50]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[49]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[48]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[47]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[46]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[45]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[44]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[43]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[42]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[41]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[40]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[39]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[38]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[37]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[36]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[35]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[34]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[33]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[32]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[31]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[30]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[29]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[28]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[27]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[26]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[25]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[24]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[23]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[22]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[21]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[20]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[19]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[18]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[17]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[16]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[15]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[14]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[13]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[12]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[11]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[10]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[9]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[8]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[7]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[6]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[5]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[4]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[3]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[2]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[1]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b1[0]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[127]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[126]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[125]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[124]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[123]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[122]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[121]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[120]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[119]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[118]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[117]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[116]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[115]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[114]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[113]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[112]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[111]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[110]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[109]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[108]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[107]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[106]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[105]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[104]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[103]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[102]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[101]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[100]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[99]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[98]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[97]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[96]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[95]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[94]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[93]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[92]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[91]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[90]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[89]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[88]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[87]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[86]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[85]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[84]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[83]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[82]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[81]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[80]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[79]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[78]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[77]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[76]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[75]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[74]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[73]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[72]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[71]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[70]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[69]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[68]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[67]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[66]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[65]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[64]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[63]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[62]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[61]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[60]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[59]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[58]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[57]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[56]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[55]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[54]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[53]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[52]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[51]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[50]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[49]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[48]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[47]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[46]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[45]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[44]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[43]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[42]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[41]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[40]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[39]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[38]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[37]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[36]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[35]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[34]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[33]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[32]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[31]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[30]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[29]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[28]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[27]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[26]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[25]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[24]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[23]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[22]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[21]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[20]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[19]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[18]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[17]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[16]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[15]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[14]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[13]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[12]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[11]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[10]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[9]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[8]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[7]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[6]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[5]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[4]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[3]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[2]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[1]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b2[0]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[127]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[126]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[125]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[124]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[123]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[122]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[121]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[120]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[119]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[118]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[117]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[116]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[115]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[114]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[113]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[112]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[111]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[110]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[109]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[108]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[107]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[106]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[105]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[104]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[103]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[102]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[101]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[100]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[99]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[98]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[97]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[96]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[95]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[94]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[93]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[92]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[91]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[90]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[89]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[88]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[87]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[86]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[85]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[84]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[83]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[82]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[81]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[80]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[79]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[78]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[77]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[76]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[75]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[74]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[73]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[72]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[71]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[70]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[69]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[68]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[67]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[66]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[65]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[64]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[63]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[62]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[61]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[60]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[59]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[58]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[57]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[56]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[55]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[54]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[53]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[52]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[51]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[50]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[49]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[48]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[47]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[46]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[45]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[44]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[43]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[42]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[41]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[40]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[39]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[38]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[37]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[36]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[35]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[34]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[33]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[32]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[31]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[30]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[29]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[28]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[27]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[26]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[25]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[24]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[23]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[22]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[21]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[20]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[19]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[18]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[17]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[16]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[15]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[14]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[13]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[12]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[11]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[10]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[9]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[8]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[7]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[6]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[5]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[4]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[3]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[2]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[1]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_b3[0]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[35]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[34]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[33]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[32]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[31]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[30]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[29]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[28]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[27]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[26]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[25]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[24]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[23]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[22]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[21]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[20]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[19]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[18]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[17]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[16]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[15]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[14]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[13]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[12]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[11]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[10]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[9]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[8]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[7]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[6]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[5]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[4]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[3]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[2]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[1]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_weight[0]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_bias[3]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_bias[2]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_bias[1]}]
set_input_delay -clock clk  1  [get_ports {sram_rdata_bias[0]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a0[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a0[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a0[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a0[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a0[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a0[0]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a1[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a1[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a1[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a1[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a1[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a1[0]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a2[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a2[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a2[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a2[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a2[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a2[0]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a3[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a3[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a3[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a3[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a3[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_a3[0]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b0[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b0[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b0[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b0[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b0[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b0[0]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b1[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b1[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b1[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b1[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b1[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b1[0]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b2[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b2[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b2[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b2[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b2[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b2[0]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b3[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b3[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b3[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b3[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b3[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_b3[0]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_weight[10]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_weight[9]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_weight[8]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_weight[7]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_weight[6]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_weight[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_weight[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_weight[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_weight[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_weight[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_weight[0]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_bias[6]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_bias[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_bias[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_bias[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_bias[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_bias[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_raddr_bias[0]}]
set_output_delay -clock clk  1.35  [get_ports busy]
set_output_delay -clock clk  1.35  [get_ports test_layer_finish]
set_output_delay -clock clk  1.35  [get_ports valid]
set_output_delay -clock clk  1.35  [get_ports sram_wen_a0]
set_output_delay -clock clk  1.35  [get_ports sram_wen_a1]
set_output_delay -clock clk  1.35  [get_ports sram_wen_a2]
set_output_delay -clock clk  1.35  [get_ports sram_wen_a3]
set_output_delay -clock clk  1.35  [get_ports sram_wen_b0]
set_output_delay -clock clk  1.35  [get_ports sram_wen_b1]
set_output_delay -clock clk  1.35  [get_ports sram_wen_b2]
set_output_delay -clock clk  1.35  [get_ports sram_wen_b3]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[15]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[14]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[13]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[12]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[11]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[10]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[9]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[8]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[7]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[6]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_a[0]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[15]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[14]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[13]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[12]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[11]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[10]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[9]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[8]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[7]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[6]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_bytemask_b[0]}]
set_output_delay -clock clk  1.35  [get_ports {sram_waddr_a[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_waddr_a[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_waddr_a[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_waddr_a[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_waddr_a[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_waddr_a[0]}]
set_output_delay -clock clk  1.35  [get_ports {sram_waddr_b[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_waddr_b[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_waddr_b[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_waddr_b[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_waddr_b[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_waddr_b[0]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[127]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[126]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[125]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[124]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[123]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[122]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[121]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[120]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[119]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[118]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[117]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[116]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[115]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[114]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[113]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[112]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[111]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[110]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[109]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[108]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[107]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[106]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[105]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[104]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[103]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[102]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[101]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[100]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[99]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[98]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[97]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[96]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[95]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[94]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[93]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[92]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[91]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[90]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[89]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[88]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[87]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[86]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[85]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[84]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[83]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[82]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[81]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[80]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[79]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[78]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[77]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[76]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[75]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[74]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[73]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[72]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[71]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[70]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[69]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[68]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[67]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[66]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[65]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[64]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[63]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[62]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[61]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[60]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[59]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[58]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[57]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[56]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[55]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[54]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[53]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[52]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[51]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[50]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[49]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[48]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[47]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[46]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[45]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[44]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[43]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[42]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[41]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[40]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[39]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[38]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[37]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[36]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[35]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[34]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[33]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[32]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[31]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[30]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[29]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[28]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[27]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[26]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[25]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[24]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[23]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[22]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[21]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[20]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[19]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[18]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[17]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[16]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[15]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[14]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[13]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[12]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[11]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[10]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[9]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[8]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[7]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[6]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_a[0]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[127]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[126]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[125]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[124]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[123]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[122]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[121]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[120]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[119]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[118]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[117]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[116]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[115]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[114]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[113]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[112]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[111]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[110]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[109]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[108]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[107]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[106]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[105]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[104]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[103]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[102]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[101]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[100]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[99]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[98]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[97]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[96]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[95]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[94]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[93]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[92]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[91]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[90]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[89]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[88]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[87]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[86]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[85]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[84]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[83]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[82]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[81]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[80]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[79]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[78]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[77]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[76]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[75]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[74]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[73]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[72]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[71]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[70]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[69]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[68]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[67]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[66]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[65]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[64]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[63]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[62]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[61]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[60]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[59]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[58]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[57]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[56]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[55]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[54]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[53]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[52]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[51]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[50]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[49]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[48]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[47]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[46]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[45]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[44]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[43]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[42]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[41]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[40]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[39]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[38]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[37]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[36]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[35]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[34]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[33]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[32]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[31]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[30]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[29]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[28]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[27]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[26]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[25]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[24]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[23]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[22]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[21]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[20]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[19]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[18]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[17]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[16]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[15]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[14]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[13]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[12]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[11]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[10]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[9]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[8]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[7]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[6]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[5]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[4]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[3]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[2]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[1]}]
set_output_delay -clock clk  1.35  [get_ports {sram_wdata_b[0]}]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_state_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_state_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_state_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_state_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_y_cnt_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_y_cnt_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_y_cnt_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_y_cnt_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_15__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_15__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_15__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_15__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_15__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_15__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_15__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_15__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_15__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_15__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_15__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_15__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_15__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_15__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_15__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_15__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_14__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_14__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_14__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_14__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_14__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_14__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_14__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_14__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_14__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_14__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_14__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_14__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_14__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_14__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_14__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_14__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_13__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_13__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_13__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_13__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_13__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_13__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_13__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_13__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_13__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_13__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_13__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_13__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_13__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_13__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_13__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_13__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_12__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_12__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_12__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_12__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_12__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_12__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_12__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_12__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_12__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_12__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_12__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_12__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_12__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_12__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_12__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_12__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_11__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_11__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_11__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_11__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_11__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_11__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_11__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_11__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_11__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_11__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_11__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_11__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_11__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_11__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_11__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_11__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_10__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_10__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_10__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_10__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_10__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_10__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_10__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_10__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_10__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_10__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_10__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_10__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_10__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_10__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_10__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_10__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_9__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_9__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_9__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_9__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_9__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_9__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_9__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_9__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_9__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_9__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_9__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_9__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_9__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_9__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_9__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_9__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_8__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_8__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_8__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_8__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_8__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_8__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_8__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_8__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_8__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_8__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_8__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_8__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_8__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_8__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_8__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_8__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_7__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_7__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_7__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_7__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_7__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_7__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_7__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_7__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_7__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_7__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_7__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_7__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_7__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_7__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_7__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_7__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_6__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_6__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_6__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_6__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_6__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_6__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_6__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_6__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_6__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_6__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_6__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_6__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_6__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_6__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_6__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_6__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_5__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_5__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_5__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_5__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_5__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_5__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_5__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_5__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_5__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_5__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_5__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_5__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_5__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_5__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_5__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_5__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_4__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_4__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_4__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_4__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_4__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_4__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_4__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_4__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_4__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_4__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_4__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_4__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_4__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_4__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_4__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_4__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_3__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_3__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_3__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_3__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_3__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_3__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_3__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_3__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_3__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_3__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_3__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_3__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_3__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_3__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_3__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_3__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_2__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_2__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_2__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_2__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_2__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_2__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_2__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_2__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_2__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_2__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_2__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_2__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_2__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_2__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_2__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_2__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_1__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_1__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_1__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_1__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_1__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_1__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_1__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_1__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_1__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_1__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_1__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_1__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_1__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_1__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_1__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_1__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_0__2__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_0__2__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_0__2__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_0__2__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_0__1__1_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_0__1__1_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_0__1__1_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_0__1__1_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_0__0__2_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_0__0__2_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_0__0__2_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_0__0__2_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_0__0__0_/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
top_CNN/clk_gate_W_reg_0__0__0_/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_0__0__0_/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
top_CNN/clk_gate_W_reg_0__0__0_/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
addr/clk_gate_sram_raddr_b3_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
addr/clk_gate_sram_raddr_b3_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
addr/clk_gate_sram_raddr_b3_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
addr/clk_gate_sram_raddr_b3_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
addr/clk_gate_sram_raddr_b2_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
addr/clk_gate_sram_raddr_b2_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
addr/clk_gate_sram_raddr_b2_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
addr/clk_gate_sram_raddr_b2_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
addr/clk_gate_sram_raddr_b1_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
addr/clk_gate_sram_raddr_b1_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
addr/clk_gate_sram_raddr_b1_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
addr/clk_gate_sram_raddr_b1_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
addr/clk_gate_sram_raddr_bias_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
addr/clk_gate_sram_raddr_bias_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
addr/clk_gate_sram_raddr_bias_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
addr/clk_gate_sram_raddr_bias_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
addr/clk_gate_sram_waddr_b_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
addr/clk_gate_sram_waddr_b_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
addr/clk_gate_sram_waddr_b_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
addr/clk_gate_sram_waddr_b_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
addr/clk_gate_final_cnt_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
addr/clk_gate_final_cnt_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
addr/clk_gate_final_cnt_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
addr/clk_gate_final_cnt_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
addr/clk_gate_final_cnt_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
addr/clk_gate_final_cnt_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
addr/clk_gate_final_cnt_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
addr/clk_gate_final_cnt_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
addr/clk_gate_sram_waddr_a_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
addr/clk_gate_sram_waddr_a_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
addr/clk_gate_sram_waddr_a_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
addr/clk_gate_sram_waddr_a_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
addr/clk_gate_sram_raddr_weight_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
addr/clk_gate_sram_raddr_weight_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
addr/clk_gate_sram_raddr_weight_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
addr/clk_gate_sram_raddr_weight_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
addr/clk_gate_sram_raddr_weight_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
addr/clk_gate_sram_raddr_weight_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
addr/clk_gate_sram_raddr_weight_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
addr/clk_gate_sram_raddr_weight_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
bytemask/clk_gate_sram_bytemask_a_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
bytemask/clk_gate_sram_bytemask_a_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
bytemask/clk_gate_sram_bytemask_a_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
bytemask/clk_gate_sram_bytemask_a_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells                               \
bytemask/clk_gate_sram_bytemask_a_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells                               \
bytemask/clk_gate_sram_bytemask_a_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells                                \
bytemask/clk_gate_sram_bytemask_a_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells                                \
bytemask/clk_gate_sram_bytemask_a_reg/main_gate]
